ERROR_MESSAGES = {
    "invalid_base64": "Некорректный формат base64 изображения",
    "invalid_image_format": "Неподдерживаемый формат изображения",
    "invalid_base64_data": "Некорректные base64 данные",
    "exercise_not_found": "Упражнение с указанным id не существует",
    "exercise_duplicate": "Упражнения не должны повторяться",
    "no_exercises": "Необходимо указать хотя бы одно упражнение",
    "empty_exercises": "Список упражнений не может быть пустым",
}


ERRORS = {
    "self_subscribe": "Нельзя подписаться на самого себя!",
    "already_subscribed": "Вы уже подписаны на этого пользователя!",
    "not_subscribed": "Вы не подписаны на этого пользователя!",
    "already_in_favorites": "План тренировок уже в избранном!",
    "not_in_favorites": "План тренировок не в избранном!",
    "already_in_cart": "Рецепт уже добавлен в корзину!",
    "not_in_cart": "Рецепт не в корзине!",
    "no_subscriptions": "Вы ни на кого не подписаны.",
    "no_image": "Необходимо загрузить изображение",
    "cant_edit": "Вы не можете изменять чужие планы тренировок",
    "cant_delete": "Вы не можете удалять чужие планы тренировок",
}
